## 
## Cadence First Encounter "v08.10-p004_1 ((32bit) 11/04/2008 14:34 (Linux 2.6))"
## Wed Aug 28 23:01:06 2024
## 
set sdc_version 1.4
current_design system_TOP
create_clock [get_ports {Uart_clk}]  -name UART_CLK -period 271 -waveform {0 135}
create_clock [get_ports {Ref_clk}]  -name REF_CLK -period 10 -waveform {0 5}
create_clock [get_ports {SCAN_CLK}]  -name SCAN_CLK -period 100 -waveform {0 50}
create_generated_clock -name UART_RX_CLK -source [get_ports {Uart_clk}] -divide_by 1 -master_clock [get_clocks {UART_CLK}] -add [get_pins {scan_clk_uart_rx_clk_mux/U1/A0}]
create_generated_clock -name UART_TX_CLK -source [get_ports {Uart_clk}] -divide_by 32 -master_clock [get_clocks {UART_CLK}] -add [get_pins {scan_clk_uart_tx_clk_mux/U1/A0}]
create_generated_clock -name ALU_CLK -source [get_ports {Ref_clk}] -divide_by 1 -master_clock [get_clocks {REF_CLK}] -add [get_pins {clock_gating_cell/dut0/ECK}]
set_propagated_clock  [get_pins {scan_clk_uart_rx_clk_mux/U1/A0}]
set_propagated_clock  [get_pins {clock_gating_cell/dut0/ECK}]
set_propagated_clock  [get_ports {Ref_clk}]
set_propagated_clock  [get_pins {scan_clk_uart_tx_clk_mux/U1/A0}]
set_propagated_clock  [get_ports {Uart_clk}]
set_propagated_clock  [get_ports {SCAN_CLK}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -rise -min -pin Y -from_pin A [get_ports {rx_in}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -fall -min -pin Y -from_pin A [get_ports {rx_in}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -rise -max -pin Y -from_pin A [get_ports {rx_in}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -fall -max -pin Y -from_pin A [get_ports {rx_in}]
set_load -pin_load -max  0.5  [get_ports {tx_out}]
set_load -pin_load -min  0.5  [get_ports {tx_out}]
set_load -pin_load -max  0.5  [get_ports {stop_error}]
set_load -pin_load -min  0.5  [get_ports {stop_error}]
set_load -pin_load -max  0.5  [get_ports {parity_error}]
set_load -pin_load -min  0.5  [get_ports {parity_error}]
set_load -pin_load -max  0.5  [get_ports {start_glitch}]
set_load -pin_load -min  0.5  [get_ports {start_glitch}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -rise -min -pin Y -from_pin A [get_ports {SI[4]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -fall -min -pin Y -from_pin A [get_ports {SI[4]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -rise -max -pin Y -from_pin A [get_ports {SI[4]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -fall -max -pin Y -from_pin A [get_ports {SI[4]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -rise -min -pin Y -from_pin A [get_ports {SI[3]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -fall -min -pin Y -from_pin A [get_ports {SI[3]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -rise -max -pin Y -from_pin A [get_ports {SI[3]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -fall -max -pin Y -from_pin A [get_ports {SI[3]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -rise -min -pin Y -from_pin A [get_ports {SI[2]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -fall -min -pin Y -from_pin A [get_ports {SI[2]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -rise -max -pin Y -from_pin A [get_ports {SI[2]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -fall -max -pin Y -from_pin A [get_ports {SI[2]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -rise -min -pin Y -from_pin A [get_ports {SI[1]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -fall -min -pin Y -from_pin A [get_ports {SI[1]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -rise -max -pin Y -from_pin A [get_ports {SI[1]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -fall -max -pin Y -from_pin A [get_ports {SI[1]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -rise -min -pin Y -from_pin A [get_ports {SI[0]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -fall -min -pin Y -from_pin A [get_ports {SI[0]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -rise -max -pin Y -from_pin A [get_ports {SI[0]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -fall -max -pin Y -from_pin A [get_ports {SI[0]}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -rise -min -pin Y -from_pin A [get_ports {SE}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -fall -min -pin Y -from_pin A [get_ports {SE}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -rise -max -pin Y -from_pin A [get_ports {SE}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -fall -max -pin Y -from_pin A [get_ports {SE}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -rise -min -pin Y -from_pin A [get_ports {TESTMODE}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -fall -min -pin Y -from_pin A [get_ports {TESTMODE}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -rise -max -pin Y -from_pin A [get_ports {TESTMODE}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -fall -max -pin Y -from_pin A [get_ports {TESTMODE}]
set_load -pin_load -max  0.5  [get_ports {SO[4]}]
set_load -pin_load -min  0.5  [get_ports {SO[4]}]
set_load -pin_load -max  0.5  [get_ports {SO[3]}]
set_load -pin_load -min  0.5  [get_ports {SO[3]}]
set_load -pin_load -max  0.5  [get_ports {SO[2]}]
set_load -pin_load -min  0.5  [get_ports {SO[2]}]
set_load -pin_load -max  0.5  [get_ports {SO[1]}]
set_load -pin_load -min  0.5  [get_ports {SO[1]}]
set_load -pin_load -max  0.5  [get_ports {SO[0]}]
set_load -pin_load -min  0.5  [get_ports {SO[0]}]
set_case_analysis 0 [get_ports {TESTMODE}]
set_case_analysis 0 [get_ports {SE}]
set_input_delay -add_delay 54.2 -clock [get_clocks {UART_CLK}] [get_ports {rx_in}]
set_input_delay -add_delay 20 -clock [get_clocks {SCAN_CLK}] [get_ports {SE}]
set_input_delay -add_delay 20 -clock [get_clocks {SCAN_CLK}] [get_ports {TESTMODE}]
set_input_delay -add_delay 20 -clock [get_clocks {SCAN_CLK}] [get_ports {SI[4]}]
set_input_delay -add_delay 20 -clock [get_clocks {SCAN_CLK}] [get_ports {SI[2]}]
set_input_delay -add_delay 20 -clock [get_clocks {SCAN_CLK}] [get_ports {SI[0]}]
set_input_delay -add_delay 20 -clock [get_clocks {SCAN_CLK}] [get_ports {SI[3]}]
set_input_delay -add_delay 20 -clock [get_clocks {SCAN_CLK}] [get_ports {SI[1]}]
set_output_delay -add_delay 20 -clock [get_clocks {SCAN_CLK}] [get_ports {SO[0]}]
set_output_delay -add_delay 54.2 -clock [get_clocks {UART_TX_CLK}] [get_ports {start_glitch}]
set_output_delay -add_delay 54.2 -clock [get_clocks {UART_TX_CLK}] [get_ports {tx_out}]
set_output_delay -add_delay 54.2 -clock [get_clocks {UART_TX_CLK}] [get_ports {parity_error}]
set_output_delay -add_delay 20 -clock [get_clocks {SCAN_CLK}] [get_ports {SO[3]}]
set_output_delay -add_delay 20 -clock [get_clocks {SCAN_CLK}] [get_ports {SO[1]}]
set_output_delay -add_delay 20 -clock [get_clocks {SCAN_CLK}] [get_ports {SO[4]}]
set_output_delay -add_delay 20 -clock [get_clocks {SCAN_CLK}] [get_ports {SO[2]}]
set_output_delay -add_delay 54.2 -clock [get_clocks {UART_TX_CLK}] [get_ports {stop_error}]
set_clock_uncertainty 0.1 -hold [get_clocks {ALU_CLK}]
set_clock_uncertainty 0.2 -setup [get_clocks {ALU_CLK}]
set_clock_uncertainty 0.1 -hold [get_clocks {UART_TX_CLK}]
set_clock_uncertainty 0.2 -setup [get_clocks {UART_TX_CLK}]
set_clock_uncertainty 0.1 -hold [get_clocks {UART_CLK}]
set_clock_uncertainty 0.2 -setup [get_clocks {UART_CLK}]
set_clock_uncertainty 0.1 -hold [get_clocks {REF_CLK}]
set_clock_uncertainty 0.2 -setup [get_clocks {REF_CLK}]
set_clock_uncertainty 0.1 -hold [get_clocks {UART_RX_CLK}]
set_clock_uncertainty 0.2 -setup [get_clocks {UART_RX_CLK}]
set_clock_uncertainty 0.1 -hold [get_clocks {SCAN_CLK}]
set_clock_uncertainty 0.2 -setup [get_clocks {SCAN_CLK}]
set_clock_groups -name REF_CLK_1 -asynchronous  -group  [get_clocks {ALU_CLK REF_CLK}] -group  [get_clocks {UART_TX_CLK UART_RX_CLK UART_CLK}] -group  [get_clocks {SCAN_CLK}]
